
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого ТекСтрокаВыплаты из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Выплаты.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТаблицаПроверка = Выплаты.Выгрузить(, "Сотрудник");
    ТаблицаПроверка.Свернуть("Сотрудник");
    
    Для Каждого Строка Из ТаблицаПроверка Цикл
        Если Строка.Сотрудник <> Справочники.ВКМ_Сотрудники.ПустаяСсылка() Тогда
            Найденные = Выплаты.НайтиСтроки(Новый Структура("Сотрудник", Строка.Сотрудник));
            Если Найденные.Количество() > 1 Тогда
                ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сотрудник %1 выбран несколько раз!", Строка.Сотрудник));
                Отказ = Истина;
                Возврат;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
