 
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор.ВидДоговора");
	ДатаОкончанияДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор.ВКМ_ДатаОкончанияДействия");
	ДатаНачалаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор.ВКМ_ДатаНачалаДействия");
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Необходимо выбрать договор абоненского обслуживания");
		Возврат;
		
	КонецЕсли;
	
	Если Дата > КонецДня(ДатаОкончанияДействия) Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Дата документа позже даты действия договора");
		
	ИначеЕсли Дата < ДатаНачалаДействия Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Дата документа раньше даты действия договора");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтоимостьЧасаРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор.ВКМ_СтоимостьЧасаРаботы");
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = СтоимостьЧасаРаботы * ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
