#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФорму(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		
		ДобавитьПоляДоговораАбоненскоеОбслуживание(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ДобавитьКомандуЗаполнить(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоляДоговораАбоненскоеОбслуживание(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("ВКМ_ДатаНачалаДействия", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
	
	ПолеВвода = Форма.Элементы.Вставить("ВКМ_ДатаОкончанияДействия", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	
	ПолеВвода = Форма.Элементы.Вставить("ВКМ_СуммаАбоненскойПлаты", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбоненскойПлаты";
	
	ПолеВвода = Форма.Элементы.Вставить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	
КонецПроцедуры

Процедура ДобавитьКомандуЗаполнить(Форма)
	
	Команда = Форма.Команды.Добавить("Заполнить");
	Команда.Заголовок = "Заполнить";
	Команда.Действие = "ВКМ_Заполнить";
	
	КнопкаФормы = Форма.Элементы.Добавить("Заполнить", Тип("КнопкаФормы"), Форма.Элементы.УслугиКоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "Заполнить";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры

#КонецОбласти
