#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДатаПроведенияРаботСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Ссылка.ДатаПроведенияРабот");
	Специалист = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Ссылка.Специалист");
	ВремяНачалаРабот = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Ссылка.ВремяНачалаРабот");
	ВремяОкончанияРабот = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Ссылка.ВремяОкончанияРабот");
	
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		
		ДатаРаботФормат = Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;");
		ВремяНачалоРаботФормат = Формат(Объект.ВремяНачалаРабот, "ДЛФ=T;");
		ВремяОкончанияРаботФормат = Формат(Объект.ВремяОкончанияРабот, "ДЛФ=T;"); 
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
		ТекстСообщения = СтрШаблон("Создан новый заказ: специалист: %1, клиент: %2, дата проведения работ: %3, 
		|Время начала: %4, Время окончания: %5, Описание проблемы: %6", 
									Объект.Специалист, Объект.Клиент, ДатаРаботФормат, 
									ВремяНачалоРаботФормат, ВремяОкончанияРаботФормат, Объект.ОписаниеПроблемы);
		НовыйЭлемент.Текст = ТекстСообщения;
		НовыйЭлемент.Записать();
		
	Иначе
		
		ТекстСообщения = Новый Массив;
		
		Если Объект.ДатаПроведенияРабот <> ДатаПроведенияРаботСсылка Тогда
			 
			ДатаРаботФормат = Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;");
			ТекстСообщения.Добавить(СтрШаблон("дата проведения работ на %1", ДатаРаботФормат));
		
		КонецЕсли;	
		
		Если Объект.Специалист <> Специалист Тогда
			
			ТекстСообщения.Добавить(СтрШаблон("специалист на %1", Объект.Специалист));
		
		КонецЕсли;
		
		Если Объект.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
			 
			ВремяНачалоРаботФормат = Формат(Объект.ВремяНачалаРабот, "ДЛФ=T;");
			ТекстСообщения.Добавить(СтрШаблон("время начала работ на %1", ВремяНачалоРаботФормат));
		
		КонецЕсли;
		
		Если Объект.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
			 
			ВремяОкончанияРаботФормат = Формат(Объект.ВремяОкончанияРабот, "ДЛФ=T;");
			ТекстСообщения.Добавить(СтрШаблон("время окончания работ на %1", ВремяОкончанияРаботФормат));
		
		КонецЕсли;
		
		Если ТекстСообщения.Количество() > 0 Тогда
			 
			ПолныйТекстСообщения = СтрСоединить(ТекстСообщения, ", ");
			ДатаФормат = Формат(Объект.Дата, "ДФ=dd.MM.yyyy;");
			НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
			ТекстСообщения = СтрШаблон("В заказе № %1 от %2 изменилось: %3", Объект.Номер, ДатаФормат, ПолныйТекстСообщения);
			НовыйЭлемент.Текст = ТекстСообщения;
			НовыйЭлемент.Записать();
			
		КонецЕсли;
					
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
