
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АбоненскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
	
	Если АбоненскоеОбслуживание Тогда
		
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	АбоненскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
	
	Если АбоненскоеОбслуживание Тогда
		
		Если Элементы.Найти("ВКМ_ДатаНачалаДействия") = Неопределено Тогда
			
			ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
			
		КонецЕсли;
		
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Истина;
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе
		
		Если Элементы.Найти("ВКМ_ДатаНачалаДействия") = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = Ложь;
		Объект.ВКМ_ДатаНачалаДействия = "";
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Ложь;
		Объект.ВКМ_ДатаОкончанияДействия = "";
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Ложь;
		Объект.ВКМ_СуммаАбоненскойПлаты = 0;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		Объект.ВКМ_СтоимостьЧасаРаботы = 0;
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти