#Область ОбработчикиСобытийЭлементовТаблицыФормыВыплаты

&НаКлиенте
Процедура ВыплатыСотрудникПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Выплаты.ТекущиеДанные;
    
    Если ТекСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
    Сумма = ВыплатыСотрудникПриИзмененииНаСервере(ИдентификаторСтроки);
    
    ТекСтрока.Сумма = Сумма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыплатыСотрудникПриИзмененииНаСервере(ИдентификаторСтроки)
	
	СтрокаТЧ = Объект.Выплаты.НайтиПоИдентификатору(ИдентификаторСтроки);
    Если СтрокаТЧ = Неопределено Или Не ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
        Возврат 0;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
    |ИЗ
    |    РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, Сотрудник = &Сотрудник) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
    
    Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
    Запрос.УстановитьПараметр("Сотрудник", СтрокаТЧ.Сотрудник);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.СуммаОстаток;
    Иначе
        Возврат 0;
    КонецЕсли;

КонецФункции

#КонецОбласти

