#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСообщения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграммБоту.Текст КАК Текст,
		|	ВКМ_УведомленияТелеграммБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграммБоту КАК ВКМ_УведомленияТелеграммБоту
		|ГДЕ
		|	НЕ ВКМ_УведомленияТелеграммБоту.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат = ВКМ_Телеграм.ОтправитьСообщениеВТелеграм(Выборка.Текст);
		
		Если Результат = 200 Тогда
			
			УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УведомлениеОбъект.Удалить();
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти