#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.Реализации.Очистить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить период");
		Возврат;		
	КонецЕсли;
	
	ДлительнаяОперация = ПолучитьДоговорыСервер();
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект);
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
    
    ЗаполнитьТЧ();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДоговорыСервер()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ВКМ_СозданиеАктовМассово.ЗаполнитьИСоздатьРеализации", 
      Объект.Период);
    Возврат ДлительнаяОперация

КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныПараметры) Экспорт

	Если Результат = Неопределено Тогда
      Возврат;
    КонецЕсли;
     
    Если Результат.Статус = "Выполнено" Тогда
    	
    	Результат = Строка(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
    	Если Результат = "Отказ" Тогда
    		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ ""Реализация товаров и услуг"" не создан по причине: не заполненны обязательные реквизиты");
    		Возврат;
    	Иначе
    		СообщениеПользователю = СтрШаблон("Количество созданных документов ""Реализация товаров и услуг"": %1", Результат);
    		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);
    	КонецЕсли;
    Иначе	
		ОбщегоНазначенияКлиент.СообщитьПользователю("Во время формирования документов произошел сбой, попробуйте повторить операцию");
      	Возврат;
    КонецЕсли;
     
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	Объект.Реализации.Очистить();
	
	ДатаНачала = Объект.Период.ДатаНачала; 
	ДатаОкончания = Объект.Период.ДатаОкончания;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|		И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия < &ДатаОкончания
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия > &ДатаНачала
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Реализации.Добавить();
		НоваяСтрока.Договор = Выборка.Договор;
		НоваяСтрока.Документ = Выборка.Реализация;				
	КонецЦикла;

КонецПроцедуры

#КонецОбласти